// app/about/page.tsx
export default function AboutPage() {
  return (
    <main className="max-w-3xl mx-auto p-8 space-y-6">
      <h1 className="text-3xl font-bold">소개</h1>

      <p>
        <strong>안녕하세요, 닥터필리스입니다.</strong>
      </p>

      <p>
        닥터필리스는 독자적인 상표권을 보유하고 있으며, 15년 경력의
        대입논술 전문 학원입니다.
      </p>

      <p>
        우리가 학술 논문을 쓸 때 네이처, 사이언스 등 저널마다 추구하는
        형식과 내용이 다르듯, 대입논술도 대학마다 기준과 방향성이 다릅니다. 
        그러나 여전히 많은 수험생들은 이러한 차이를 반영한{" "}
        <strong>체계적인 첨삭</strong>을 받지 못하고 있습니다.
      </p>

      <p>
        예를 들어, 한양대학교 인문 논술(1200자)은 구성에 대한 채점 기준은
        없지만 구체적 예증, 비판적 사고, 창의성이 높은 점수를 받습니다.
        반면 성균관대학교는 글자수 제한이 없으나 공평한 문단 분배를 요구하고,
        건국대학교처럼 1000점 만점에 합격자 분포가 700~900점까지 폭넓게 형성되는
        대학도 있습니다. 또, 중앙대학교는 글자 수 제약이 30자 내외로 협소하지만 
        내신 반영 비율과 수능 최저학력 기준이 높아, 논술의 비중이 상대적으로 낮아
        합격자에게 가장 중요한 것은 논술 준비보다 수능 준비가 중요합니다.
      </p>

      <p>
        또한 인하대학교 논술의 경우 “제시문 활용”은 단순 요약이 아닌,
        주장–반론–재반론 구조에 따라 인용하듯 서술합니다. 이는 각 대학교가 가진 전통,
        방향성, 정체성을 그대로 드러내는 특징입니다. 인하대학교의 자연계열과 의예과 논술을
        생각해보면 이해할 수 있습니다.
        
      </p>

      <p>
        저는 네이처에 논문을 여러번 통과시킨 경험이 있습니다. 가장 엄격한 1차 심사
        프로그램을 통과하는 것이 첫 관문이듯, 이것은 곧 대학별 논술전형이
        지닌 차별성과도 닮아 있습니다. 각 대학은 또 다른 이름의 네이처입니다.
      </p>

      <p>
        논술이란 무엇인가? 교사마다 다양하게 가르치지만 입시는 반드시 객관적이고 합리적이어야
        합니다. 닥터필리스 프로그램은 학생들뿐만 아니라 전국의 교사 분들을 위해
        개발된 시스템입니다.
      </p>

      <p>
        앞으로는 인문·사회·과학이 융합된 새로운 연구가 필요합니다. 
        저와 함께 세계 무대를 누빌 동지들의 시작을 응원합니다.
        대한민국에 더 많은 연구 주제가 나오길 소망하며, 그 길을 함께하겠습니다.
      </p>

      <p className="font-semibold">필리스 박사</p>
    </main>
  );
}
