// app/about/page.tsx
export default function AboutPage() {
  return (
    <main className="max-w-3xl mx-auto p-8 space-y-6 text-justify leading-relaxed">
      <h1 className="text-3xl font-bold">소개</h1>

      <p>
        <strong>안녕하세요, DR.phyllis 대입논술입니다.</strong>
      </p>

      <p>
        닥터필리스는 (주)에어래빗 AIrabbit inc에서 만든 대입논술 AI 첨삭 프로그램입니다. 
        대입논술에서 독자적인 상표권을 보유한 15년 경력의 전문가와 함께 만들었습니다.
      </p>

      <p>
        우리가 학술 논문을 쓸 때에도 네이처, 사이언스 등 저널마다 추구하는 형식과 내용이 다릅니다. 
        대입논술도 대학마다 기준과 방향성이 명확합니다. 대입논술에 합격하기 위해서는 글쓰기 실력만큼 기준에 맞게 쓰는 훈련이 필요합니다. 
        예를 들어 인하대학교는 서론이 금지되어 있으며 자료를 선택하여 &apos;활용&apos;하는 논술입니다. 
        건국대학교에서 요구하는 구체적인 &apos;자료분석&apos;과는 결이 다릅니다. 
        그러나 여전히 많은 수험생들은 이러한 차이를 반영한 <strong>체계적인 첨삭</strong>을 받지 못하고 있습니다.
      </p>

      <p>
        AI 대입논술 첨삭은 논술 전형이 강화됨에 따라 교육 사각지대에 있는 지방 학생들에게 기회를 제공하고, 
        정확한 첨삭으로 전문 강사가 활용하면 수업의 질을 높일 수 있습니다.  
        체계화된 채점 기준과 반영 비율로 학교별 맞춤 점수와 총평, 첨삭 예시 문장을 제공합니다.  
        한양대학교에서 공개하는 합격자 우수답안을 보면 인문 논술(1200자)은 구성에 대한 채점 기준 보다 
        구체적 예증, 비판적 사고, 창의성이 높은 점수를 받는다는 것을 알 수 있습니다.  
        반면, 성균관대학교는 글자 수 제한이 없으나 문단을 구성할 때 공평한 문단 분배를 요구합니다. 
        건국대학교처럼 1000점 만점에 합격자 분포가 700~900점까지 폭넓게 형성되는 대학도 있습니다. 
        중앙대학교는 내신 반영 비율과 수능 최저학력 기준이 높아 채점 기준이 엄격하지 않습니다. 
        논술전형을 합격하기 위해 가장 중요한 것이 수능 최저라고 볼 수 있습니다.
      </p>

      <p>
        이렇듯 각 대학교가 가진 전통, 방향성, 정체성을 그대로 드러내는 것이 대입논술의 특징입니다.
      </p>

      <p>
        세계적인 학술지는 기준에 맞춰 1차 심사를 통과하는 것이 첫 관문입니다. 
        이는 곧 대학별 논술 전형이 지닌 차별성과도 닮아 있습니다. 입시는 반드시 대학별 입시요강이 나올 때 확신해야합니다.
        작년에 인문논술이었던 학과가 하루 아침에 수리논술로 바뀌기도 합니다. 각 대학은 또 다른 이름의 네이처입니다.
      </p>

      <p>
        논술이란 무엇일까요? 교사마다 다양하게 가르치지만, 입시는 반드시 객관적이고 합리적이어야 합니다. 
        ALL 대학에서는 기본적으로 5문장씩 문장 점검이 가능하니 유용하게 사용해 보세요.  무분별한 빨간펜 첨삭보다 대학의 기준에 맞는 객관적 평가 방식이 합격에 더 좋은 첨삭입니다.
        이제 언제든지 닥터필리스 AI에게 모의논술 평가를 받아보세요. 
      </p>

      <p>
        대한민국의 미래는 인문·사회·과학이 융합된 새로운 연구가 필요합니다. 
        저와 함께 세계 무대를 누빌 동지들의 시작을 응원합니다. 
        글로벌하고 창의융합적인 미래형 인재, 국내 최초 AI 대입논술 첨삭이 함께하겠습니다.
      </p>

      <p className="font-semibold">필리스 박사</p>
    </main>
  );
} 